## 데이터 파일을 읽고 쓰기

### 표 형식의 데이터 파일을 읽기

pandas에서는 표 형식의 데이터 파일을 읽어 오는 몇가지의 방법이 있는데,  

그중 대표적인것이 read_csv() 이다

`DataFrame_data = pd.read_csv(file_name[, options]`

**csv 파일 작성**

In [7]:
%%writefile sea_rain1.csv
연도,동해,남해,서해,전체
1996,17.4629,17.2288,14.436,15.9067
1997,17.4116,17.4092,14.8248,16.1526
1998,17.5944,18.011,15.2512,16.6044
1999,18.1495,18.3175,14.8979,16.6284
2000,17.9288,18.1766,15.0504,16.6178

Overwriting sea_rain1.csv

In [8]:
import pandas as pd

pd.read_csv('sea_rain1.csv')

     연도       동해       남해       서해       전체
0  1996  17.4629  17.2288  14.4360  15.9067
1  1997  17.4116  17.4092  14.8248  16.1526
2  1998  17.5944  18.0110  15.2512  16.6044
3  1999  18.1495  18.3175  14.8979  16.6284
4  2000  17.9288  18.1766  15.0504  16.6178

만약 텍스트 파일이 ,가 아닌 공백으로 구분되어 있다면  
`read_csv()` 에 `sep=' '` 옵션을 추가해준다 😎

In [9]:
%%writefile sea_rain1.txt
연도 동해 남해 서해 전체
1996 17.4629 17.2288 14.436 15.9067
1997 17.4116 17.4092 14.8248 16.1526
1998 17.5944 18.011 15.2512 16.6044
1999 18.1495 18.3175 14.8979 16.6284
2000 17.9288 18.1766 15.0504 16.6178

Writing sea_rain1.txt

In [10]:
pd.read_csv('sea_rain1.txt',sep=' ')

     연도       동해       남해       서해       전체
0  1996  17.4629  17.2288  14.4360  15.9067
1  1997  17.4116  17.4092  14.8248  16.1526
2  1998  17.5944  18.0110  15.2512  16.6044
3  1999  18.1495  18.3175  14.8979  16.6284
4  2000  17.9288  18.1766  15.0504  16.6178

  
자동으로 생성된 index가 아닌 데이터 파일의 특정 열을 index로 설정하려면  

옵션으로 `index_col='열 이름` 을 추가해준다

In [11]:
pd.read_csv('sea_rain1.csv',index_col='연도')

           동해       남해       서해       전체
연도
1996  17.4629  17.2288  14.4360  15.9067
1997  17.4116  17.4092  14.8248  16.1526
1998  17.5944  18.0110  15.2512  16.6044
1999  18.1495  18.3175  14.8979  16.6284
2000  17.9288  18.1766  15.0504  16.6178

### 표 형식의 데이터를 파일로 쓰기

`DataFrame_data.to_csv(filename[, options])`

In [17]:
df_pr = pd.DataFrame({'판매가격':[2000, 3000, 5000, 10000],
                      '판매량':[32, 53, 40, 25]},
                     index=['P1001', 'P1002', 'P1003', 'P1004'])
df_pr.index.name = '제품번호'
df_pr

        판매가격  판매량
제품번호
P1001   2000   32
P1002   3000   53
P1003   5000   40
P1004  10000   25

텍스트 파일로 저장

In [26]:
file_name = 'save_DataFrame_cp949.txt'
df_pr.to_csv(file_name, sep=' ',encoding='cp949')